Revit 2027 API
PanelScheduleData.ScheduleType Property
 The panel schedule type of this panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelScheduleType ScheduleType { get; }
Public ReadOnly Property ScheduleType As PanelScheduleType
	Get
public:
property PanelScheduleType ScheduleType {
	PanelScheduleType get ();
}
member ScheduleType : PanelScheduleType with get
Property Value
PanelScheduleType
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace